def servis_list():
    servis_sort = [
        (0, "Медикаментозное кодирование"),
        (1, "Довженко от алкоголизма кодирование"),
        (2, "Довженко от табакокурения кодирование"),
        (3, "Довженко от лишнего веса кодирование"),
        (4, "Транскрониальное кодирование от алкоголизма"),
        (5, "Транскрониальное кодирование от табакокурения"),
        (6, "Датоксикация от алкоголя (капельница)"),
        (7, "Психотерапия"),
        (8, "Консультация вес"),
        (9, "Раскодирование"),
        (10, "Консультация психиатр"),
        (11, "Консультация алкоголизм, тобак"),
        (12, "Лазерное кодирование от алкоголя"),
        (13, "Консультация психотерапия"),
    ]    
    return servis_sort

def validity():
    time_list = {
        "time": [1,2,3,4,5,6,7,8,9,10],
        "month": "Месяц",
        "yahr": "Год",
    }
    return time_list


def abracadabra():
    abr_list = {
        0: ["м/к", "эспераль",],
        1: ["Д-алк", "Д"],
        "time": "\d", 
        "month": ["м", "мес"],
        "yahr": ["года", "г", "лет"],
        13: ["кон", "конс-я"],
        7: ["п/тер", "п/терап."],
        "data": ["(\d+г+)", "\d+м+"],
        9: ["раск.",],
        6: ['кап.',],
        12: ["L-код",],

    }
    return abr_list

def replasment():
    return [
        ("1 г", "1г"),
        (",", ""),
        ("/м", " м"),
        ("м/к", "Мед-код "),
        ("/и", " и"),
        ("/ ", " "),
        ("/р", " р"),
        ("3\s+г", "3г"),
        ("4\s+г", "4г"),
        ("5\s+л", "5л"),
        ("10\s+л", "10л"),
        ("6\s+м", "6м"),
        ("3\s+м", "3м"),
        ("L- к", "L-к"),
        ("L - к", "L-к"),
        ("\"Д\"таб", "Довженко-таб"),
        ("\"Д\"алк", "Довженко-алк"),
        ("\"Д\"\s+алк", "Довженко-алк"),
        ("\"Д\"\s+таб", "Довженко-таб"),
    ]
    # return replase_values
